
/* Задача.
	Изменить формулу, (2 ^ (8 * byte * (размер переменной) - 1) - 1) таким образом,
	чтобы можно было рассчитать максимальные значения для типов со спецификатором unsigned.
*/

/* Объяснение.
	Разберем первоначальную формулу. 

	Типы в "обычном" виде: char, short, int, long long int, float - центрированны
	относительно "0". (Кол-во отрицательных и не отрицательных эл-ов совпадает).
	Из-за этого в степени 2ойки возникает " - 1" - чтобы разбить
	априорино четное кол-во эл-ов на равные части.

	Т.е. Математически max(f(x)) = |min(f(x))|,
	Однако "0" является не отрицательным эл-ом => значение max(f(x)) не будет соотвествовать
	порядковому номеру последнего (наибольшего) эл-а. А будет равно = max(f(x)) = |min(f(x))| - 1.
	Так возникает " - 1" в выражении.

	Значит, кол-во эл-ов = 2 ^ (8 * byte * (размер переменной));
	И используя только не отрицательные значения (unsigned), не забыв что отсчет эл-ов
	начинается с "0", получим формулу для расчета максимального значения базовых (unsigned) типов =>
	=> 2 ^ (8 * byte * (размер переменной)) - 1.

	По ней и будет проводиться расчет. ↑↑↑
*/


#include<iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");

	unsigned char a = UCHAR_MAX;
	short CalcChar = pow(2, 8 * sizeof(a)) - 1;
	
	unsigned short b = USHRT_MAX, CalcShort; // Где calc - calculus; рассчетное (значение).
	CalcShort = pow(2, 8 * sizeof(b)) - 1;

	unsigned int c = UINT_MAX, CalcInt;
	CalcInt = pow(2, 8 * sizeof(c)) - 1;

	unsigned long long d = ULLONG_MAX, CalcLLInt;
	CalcLLInt = powl(2,8 * sizeof(d)) - 1;				// wtf ?! = 2^63?
	
	cout << "Константа максимального значения для unsigned char: " << a
		<< "\nРасчетное значение: " << CalcChar
		
		<< "\n\nКонстанта максимального значения для unsigned short: " << b
		<< "\nРасчетное значение: " << CalcShort

		<< "\n\nКонстанта максимального значения для unsigned int: " << c
		<< "\nРасчетное значение: " << CalcInt

		<< "\n\nКонстанта максимального значения для unsigned long long int: " << d
		<< "\nРасчетное значение: " << CalcLLInt << endl;
}